[
    {
      "id": "flat-ui",
      "isPublished": true,
      "areaId": 1,
      "name": "Flat UI",
      "description": "Даний курс вивчає мінімалістичний підхід до дизайну об'єктів, який підкреслює зручність використання, більшою мірою орієнтований на кінцевого користувача. Курс буде цікавий студентам, які хотіли б оволодіти мистецтвом розробки веб-ресурсів згідно нових тенденцій дизайну",
      "startDate": "2032-10-11",
      "duration": 10,
      "schedule": "Сб, Пн, Пт",
      "minStudents": 17,
      "applicantsNumber": 15,
      "image": "img/flat_ui.png"
    },
    {
      "id": "css",
      "isPublished": true,
      "areaId": 1,
      "name": "CSS",
      "description": "Будуть розглянуті сучасні можливості каскадних таблиць стилів і їхню підтримку востанніх популярних браузерах",
      "startDate": "2034-01-27",
      "duration": 1,
      "schedule": "Сб, Чт, Пт",
      "minStudents": 12,
      "applicantsNumber": 12,
      "image": "img/css.png"
    },
    {
      "id": "html",
      "isPublished": true,
      "areaId": 1,
      "name": "HTML",
      "description": "Даний курс складається з п'яти модулів та екзаменаційного завдання. Кожен модуль містить посилання на матеріали відеохарактеру та допоміжну інформацію. Курс буде цікавий студентам, які хотіли б оволодіти мистецтвом розробки веб-ресурсів згідно нових тенденцій дизайну",
      "startDate": "2002-05-31",
      "duration": 5,
      "schedule": "Сб, Пн, Ср, Пт",
      "minStudents": 17,
      "applicantsNumber": 18,
      "image": "img/html.png"
    },
    {
      "id": "java",
      "isPublished": true,
      "areaId": 2,
      "name": "Java",
      "description": "Даний курс орієнтований на вивчення Java як людьми з мінімальним рівнем знання програмування так і людей, які хочуть покращити свої знання з певних нюансів мови.",
      "startDate": "2050-05-31",
      "duration": 2,
      "schedule": "Сб, Вт",
      "minStudents": 1,
      "applicantsNumber": 12,
      "image": "img/java.png"
    },
    {
      "id": ".net",
      "isPublished": true,
      "areaId": 3,
      "name": ".Net",
      "description": "У Вас буде можливість вивчити технології та підходи до розробки Web-програм з багаторівневою архітектурою. Ви отримаєте досвід побудови Web-програм засобами ASP.NET MVC, Silverlight, побудови десктопних програм засобами WPF, реалізацію ORM засобами ADO.NET Entity, а також розробки Web-сервісів з допомогою WСF.",
      "startDate": "2003-11-04",
      "duration": 2,
      "schedule": "Сб, Пн",
      "minStudents": 10,
      "applicantsNumber": 5,
      "image": "img/_net.png"
    },
    {
      "id": "ux",
      "isPublished": true,
      "areaId": 4,
      "name": "UX",
      "description": "Програма навчання сформована відповідно до вимог провідних ІТ компаній, що підтверджує Львівський Кластер ІТ-BPO. Це можливість всім починаючим дизайнерам та архітекторам з головою поринути в світ найперспективнішої сфери – дизайну в ІТ. Ринок потребує нових спеціалістів і Lviv UI/UX School ставить собі за мету підготувати справжніх професіоналів дизайну.",
      "startDate": "2080-04-08",
      "duration": 4,
      "schedule": "Сб, Чт",
      "minStudents": 10,
      "applicantsNumber": 8,
      "image": "img/ux.png"
    }
]